Table of Contents
 Class ConcreteULSCheckResultFatigueEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ULS Check Fatigue Ec2
public class ConcreteULSCheckResultFatigueEc2 : ConcreteULSCheckResultFatigue
Inheritance
object
ConcreteCheckResultBase
ConcreteULSCheckResultFatigue
ConcreteULSCheckResultFatigueEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 DecissionMethod
decision fatigue check
public FatigueMethod DecissionMethod { get; set; }
Property Value
FatigueMethod
 InternalForceMax
internal forces for fatigue calculation max
public ResultOfInternalForces InternalForceMax { get; set; }
Property Value
ResultOfInternalForces
 InternalForceMin
internal forces for fatigue calculation min
public ResultOfInternalForces InternalForceMin { get; set; }
Property Value
ResultOfInternalForces
 Edit this page